In [1]:
import pandas as pd

In [47]:
df = pd.read_csv(r'C:\\Users\\ASHISH NEHRA\\Desktop\\trip_data\\202408-divvy-tripdata.csv')
df.head()

,ride_id,rideable_type,started_at,ended_at,ride_length,day_of_week,start_station_name,start_station_id,end_station_name,end_station_id,start_lat,start_lng,end_lat,end_lng,member_casual
0,BAA154388A869E64,classic_bike,35:14.4,48:24.4,0:13:10,6,State St & Randolph St,TA1305000029,Wabash Ave & 9th St,TA1309000010,41.884621,-87.627834,41.870769,-87.625734,member
1,8752245932EFF67A,electric_bike,33:14.0,55:23.9,0:22:10,6,Franklin St & Monroe St,TA1309000007,Damen Ave & Cortland St,13133,41.880317,-87.635185,41.915983,-87.677335,member
2,44DDF9F57A9A161F,classic_bike,44:06.2,57:52.1,0:13:46,6,Franklin St & Monroe St,TA1309000007,Clark St & Elm St,TA1307000039,41.880317,-87.635185,41.902973,-87.631280,member
3,44AAAF069B0C78C3,electric_bike,47:11.9,56:33.3,0:09:21,2,Clark St & Elm St,TA1307000039,McClurg Ct & Ohio St,TA1306000029,41.902973,-87.631280,41.892592,-87.617289,member
4,77138D500A6B7B4B,classic_bike,34:20.6,46:29.3,0:12:09,7,Western Ave & Leland Ave,TA1307000140,Ashland Ave & Belle Plaine Ave,13249,41.966400,-87.688704,41.956057,-87.668835,casual

In [48]:
df.shape

(755639, 15)

In [49]:
df[df.columns[7]].count()

615048

In [50]:
df.describe()

,day_of_week,start_lat,start_lng,end_lat,end_lng
count,755639.000000,755639.000000,755639.000000,754612.000000,754612.000000
mean,4.314666,41.904483,-87.646041,41.904796,-87.646316
std,2.053384,0.042206,0.027144,0.062876,0.037334
min,1.000000,41.648501,-87.900000,16.060000,-97.470000
25%,3.000000,41.882134,-87.660000,41.882409,-87.660000
50%,5.000000,41.899930,-87.641170,41.900000,-87.641763
75%,6.000000,41.930000,-87.628722,41.930000,-87.629318
max,7.000000,42.070000,-87.520000,46.160000,-79.020000

In [57]:
df['rideable_type'].value_counts()

electric_bike    402650
classic_bike     352989
Name: rideable_type, dtype: int64

In [58]:
df['start_station_id'].count()

615048

In [59]:
df['end_station_id'].count()

613414

In [60]:
df.isnull().sum()

ride_id                    0
rideable_type              0
started_at                 0
ended_at                   0
ride_length                0
 day_of_week               0
start_station_name    140591
start_station_id      140591
end_station_name      142225
end_station_id        142225
start_lat                  0
start_lng                  0
end_lat                 1027
end_lng                 1027
member_casual              0
dtype: int64

In [61]:
df['member_casual'].value_counts()

member    437359
casual    318280
Name: member_casual, dtype: int64

In [63]:
df[' day_of_week '].value_counts()

7    145062
6    125055
5    113501
1    102225
4     99062
3     87120
2     83614
Name:  day_of_week , dtype: int64

In [70]:
df.groupby([' day_of_week ', 'member_casual']).size().unstack(fill_value=0)

member_casual  casual  member
 day_of_week
1               52342   49883
2               29919   53695
3               29254   57866
4               34783   64279
5               41138   72363
6               53515   71540
7               77329   67733

In [72]:
df['ride_length'].count()

755639

In [81]:
df.groupby([' day_of_week ','member_casual'])['ride_length'].mean().unstack()

member_casual     casual     member
 day_of_week
1              24.442139  14.606859
2              20.545937  12.159421
3              19.254149  12.064618
4              20.846452  12.652992
5              19.204384  12.225188
6              21.423495  12.638081
7              24.288015  14.384351

In [75]:
df.dtypes

ride_id                        object
rideable_type                  object
started_at                     object
ended_at                       object
ride_length           timedelta64[ns]
 day_of_week                    int64
start_station_name             object
start_station_id               object
end_station_name               object
end_station_id                 object
start_lat                     float64
start_lng                     float64
end_lat                       float64
end_lng                       float64
member_casual                  object
dtype: object

In [74]:
df['ride_length'] = pd.to_timedelta(df['ride_length'])

In [77]:
df['ride_length'] = df['ride_length'] / pd.Timedelta(minutes=1)

In [78]:
df['ride_length']

0         13.166667
1         22.166667
2         13.766667
3          9.350000
4         12.150000
            ...
755634    17.400000
755635    14.116667
755636     2.300000
755637    24.350000
755638    18.250000
Name: ride_length, Length: 755639, dtype: float64

In [87]:
df['ride_id'].nunique()

755639

In [95]:
df.groupby(['start_station_name']).size().sort_values(ascending = False)

start_station_name
Streeter Dr & Grand Ave                   10941
DuSable Lake Shore Dr & North Blvd         7210
DuSable Lake Shore Dr & Monroe St          7005
Michigan Ave & Oak St                      6513
Theater on the Lake                        5203
                                          ...
Public Rack - Monticello & Lawrence           1
Public Rack - Ewing Ave & 106th St NW         1
Public Rack - Morgan St & 95th St             1
Public Rack - Mulligan & Northwest Hwy        1
Panama Ave & Grace St                         1
Length: 1377, dtype: int64